## ✅ YES Plan Succeeded | `data-staging`
📍 `envs/staging/data` | 🎯 [@wangzitian0](https://github.com/wangzitian0/infra/pull/359#issuecomment-3687493142) | 💡 Run `atlantis apply -p data-staging`
<details><summary>📜 Output</summary>

```diff
infra-flash-commit:1d442b1 

Terragrunt already installed: terragrunt version v0.96.1

Cleaning old generated .tf files...
✅ Cleanup complete

17:57:56.330 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
17:57:56.378 WARN   Config ../../../platform/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
17:57:59.640 STDOUT terraform1.11.0: data.terraform_remote_state.l2_platform: Reading...
17:57:59.675 STDOUT terraform1.11.0: random_password.signoz_clickhouse: Refreshing state... [id=none]
17:57:59.675 STDOUT terraform1.11.0: random_password.openpanel_postgres: Refreshing state... [id=none]
17:57:59.675 STDOUT terraform1.11.0: random_password.postgres: Refreshing state... [id=none]
17:57:59.711 STDOUT terraform1.11.0: random_password.openpanel_clickhouse: Refreshing state... [id=none]
17:57:59.711 STDOUT terraform1.11.0: random_password.redis: Refreshing state... [id=none]
17:57:59.711 STDOUT terraform1.11.0: random_bytes.arangodb_jwt: Refreshing state...
17:57:59.712 STDOUT terraform1.11.0: random_password.arangodb: Refreshing state... [id=none]
17:57:59.775 STDOUT terraform1.11.0: random_password.clickhouse: Refreshing state... [id=none]
17:57:59.917 STDOUT terraform1.11.0: data.terraform_remote_state.l2_platform: Read complete after 0s
17:58:05.026 STDOUT terraform1.11.0: Terraform used the selected providers to generate the following execution
17:58:05.026 STDOUT terraform1.11.0: plan. Resource actions are indicated with the following symbols:
17:58:05.026 STDOUT terraform1.11.0:   + create
17:58:05.026 STDOUT terraform1.11.0: Terraform will perform the following actions:
17:58:05.026 STDOUT terraform1.11.0:   # clickhousedbops_database.openpanel_events will be created
17:58:05.026 STDOUT terraform1.11.0:   + resource "clickhousedbops_database" "openpanel_events" {
17:58:05.027 STDOUT terraform1.11.0:       + name = "openpanel_events"
17:58:05.027 STDOUT terraform1.11.0:       + uuid = (known after apply)
17:58:05.027 STDOUT terraform1.11.0:     }
17:58:05.027 STDOUT terraform1.11.0:   # clickhousedbops_database.signoz_logs will be created
17:58:05.027 STDOUT terraform1.11.0:   + resource "clickhousedbops_database" "signoz_logs" {
17:58:05.027 STDOUT terraform1.11.0:       + name = "signoz_logs"
17:58:05.027 STDOUT terraform1.11.0:       + uuid = (known after apply)
17:58:05.027 STDOUT terraform1.11.0:     }
17:58:05.027 STDOUT terraform1.11.0:   # clickhousedbops_database.signoz_metrics will be created
17:58:05.027 STDOUT terraform1.11.0:   + resource "clickhousedbops_database" "signoz_metrics" {
17:58:05.027 STDOUT terraform1.11.0:       + name = "signoz_metrics"
17:58:05.027 STDOUT terraform1.11.0:       + uuid = (known after apply)
17:58:05.027 STDOUT terraform1.11.0:     }
17:58:05.027 STDOUT terraform1.11.0:   # clickhousedbops_database.signoz_traces will be created
17:58:05.027 STDOUT terraform1.11.0:   + resource "clickhousedbops_database" "signoz_traces" {
17:58:05.027 STDOUT terraform1.11.0:       + name = "signoz_traces"
17:58:05.027 STDOUT terraform1.11.0:       + uuid = (known after apply)
17:58:05.027 STDOUT terraform1.11.0:     }
17:58:05.027 STDOUT terraform1.11.0:   # clickhousedbops_user.openpanel will be created
17:58:05.027 STDOUT terraform1.11.0:   + resource "clickhousedbops_user" "openpanel" {
17:58:05.027 STDOUT terraform1.11.0:       + id                              = (known after apply)
17:58:05.027 STDOUT terraform1.11.0:       + name                            = "openpanel"
17:58:05.027 STDOUT terraform1.11.0:       + password_sha256_hash_wo         = (write-only attribute)
17:58:05.028 STDOUT terraform1.11.0:       + password_sha256_hash_wo_version = 1
17:58:05.028 STDOUT terraform1.11.0:     }
17:58:05.028 STDOUT terraform1.11.0:   # clickhousedbops_user.signoz will be created
17:58:05.028 STDOUT terraform1.11.0:   + resource "clickhousedbops_user" "signoz" {
17:58:05.028 STDOUT terraform1.11.0:       + id                              = (known after apply)
17:58:05.028 STDOUT terraform1.11.0:       + name                            = "signoz"
17:58:05.028 STDOUT terraform1.11.0:       + password_sha256_hash_wo         = (write-only attribute)
17:58:05.028 STDOUT terraform1.11.0:       + password_sha256_hash_wo_version = 1
17:58:05.028 STDOUT terraform1.11.0:     }
17:58:05.028 STDOUT terraform1.11.0:   # helm_release.arangodb_operator will be created
17:58:05.028 STDOUT terraform1.11.0:   + resource "helm_release" "arangodb_operator" {
17:58:05.028 STDOUT terraform1.11.0:       + atomic                     = false
17:58:05.028 STDOUT terraform1.11.0:       + chart                      = "kube-arangodb"
17:58:05.028 STDOUT terraform1.11.0:       + cleanup_on_fail            = false
17:58:05.028 STDOUT terraform1.11.0:       + create_namespace           = false
17:58:05.028 STDOUT terraform1.11.0:       + dependency_update          = false
17:58:05.028 STDOUT terraform1.11.0:       + disable_crd_hooks          = false
17:58:05.028 STDOUT terraform1.11.0:       + disable_openapi_validation = false
17:58:05.028 STDOUT terraform1.11.0:       + disable_webhooks           = false
17:58:05.028 STDOUT terraform1.11.0:       + force_update               = false
17:58:05.028 STDOUT terraform1.11.0:       + id                         = (known after apply)
17:58:05.028 STDOUT terraform1.11.0:       + lint                       = false
17:58:05.028 STDOUT terraform1.11.0:       + manifest                   = (known after apply)
17:58:05.029 STDOUT terraform1.11.0:       + max_history                = 0
17:58:05.029 STDOUT terraform1.11.0:       + metadata                   = (known after apply)
17:58:05.029 STDOUT terraform1.11.0:       + name                       = "arangodb-operator"
17:58:05.029 STDOUT terraform1.11.0:       + namespace                  = "data-staging"
17:58:05.029 STDOUT terraform1.11.0:       + pass_credentials           = false
17:58:05.029 STDOUT terraform1.11.0:       + recreate_pods              = false
17:58:05.029 STDOUT terraform1.11.0:       + render_subchart_notes      = true
17:58:05.029 STDOUT terraform1.11.0:       + replace                    = false
17:58:05.029 STDOUT terraform1.11.0:       + repository                 = "https://arangodb.github.io/kube-arangodb"
17:58:05.029 STDOUT terraform1.11.0:       + reset_values               = false
17:58:05.029 STDOUT terraform1.11.0:       + reuse_values               = false
17:58:05.029 STDOUT terraform1.11.0:       + skip_crds                  = false
17:58:05.029 STDOUT terraform1.11.0:       + status                     = "deployed"
17:58:05.029 STDOUT terraform1.11.0:       + timeout                    = 300
17:58:05.029 STDOUT terraform1.11.0:       + values                     = [
17:58:05.029 STDOUT terraform1.11.0:           + <<-EOT
17:58:05.029 STDOUT terraform1.11.0:                 "operator":
17:58:05.029 STDOUT terraform1.11.0:                   "replicaCount": 1
17:58:05.029 STDOUT terraform1.11.0:                   "resources":
17:58:05.029 STDOUT terraform1.11.0:                     "limits":
17:58:05.029 STDOUT terraform1.11.0:                       "cpu": "200m"
17:58:05.029 STDOUT terraform1.11.0:                       "memory": "256Mi"
17:58:05.029 STDOUT terraform1.11.0:                     "requests":
17:58:05.029 STDOUT terraform1.11.0:                       "cpu": "50m"
17:58:05.029 STDOUT terraform1.11.0:                       "memory": "64Mi"
17:58:05.029 STDOUT terraform1.11.0:             EOT,
17:58:05.029 STDOUT terraform1.11.0:         ]
17:58:05.029 STDOUT terraform1.11.0:       + verify                     = false
17:58:05.029 STDOUT terraform1.11.0:       + version                    = "1.2.43"
17:58:05.029 STDOUT terraform1.11.0:       + wait                       = true
17:58:05.029 STDOUT terraform1.11.0:       + wait_for_jobs              = true
17:58:05.029 STDOUT terraform1.11.0:     }
17:58:05.030 STDOUT terraform1.11.0:   # helm_release.clickhouse will be created
17:58:05.030 STDOUT terraform1.11.0:   + resource "helm_release" "clickhouse" {
17:58:05.030 STDOUT terraform1.11.0:       + atomic                     = false
17:58:05.030 STDOUT terraform1.11.0:       + chart                      = "clickhouse"
17:58:05.030 STDOUT terraform1.11.0:       + cleanup_on_fail            = false
17:58:05.030 STDOUT terraform1.11.0:       + create_namespace           = false
17:58:05.030 STDOUT terraform1.11.0:       + dependency_update          = false
17:58:05.030 STDOUT terraform1.11.0:       + disable_crd_hooks          = false
17:58:05.030 STDOUT terraform1.11.0:       + disable_openapi_validation = false
17:58:05.030 STDOUT terraform1.11.0:       + disable_webhooks           = false
17:58:05.030 STDOUT terraform1.11.0:       + force_update               = false
17:58:05.030 STDOUT terraform1.11.0:       + id                         = (known after apply)
17:58:05.030 STDOUT terraform1.11.0:       + lint                       = false
17:58:05.030 STDOUT terraform1.11.0:       + manifest                   = (known after apply)
17:58:05.030 STDOUT terraform1.11.0:       + max_history                = 0
17:58:05.030 STDOUT terraform1.11.0:       + metadata                   = (known after apply)
17:58:05.030 STDOUT terraform1.11.0:       + name                       = "clickhouse"
17:58:05.030 STDOUT terraform1.11.0:       + namespace                  = "data-staging"
17:58:05.030 STDOUT terraform1.11.0:       + pass_credentials           = false
17:58:05.030 STDOUT terraform1.11.0:       + recreate_pods              = false
17:58:05.030 STDOUT terraform1.11.0:       + render_subchart_notes      = true
17:58:05.030 STDOUT terraform1.11.0:       + replace                    = false
17:58:05.030 STDOUT terraform1.11.0:       + repository                 = "oci://registry-1.docker.io/bitnamicharts"
17:58:05.030 STDOUT terraform1.11.0:       + reset_values               = false
17:58:05.030 STDOUT terraform1.11.0:       + reuse_values               = false
17:58:05.030 STDOUT terraform1.11.0:       + skip_crds                  = false
17:58:05.030 STDOUT terraform1.11.0:       + status                     = "deployed"
17:58:05.031 STDOUT terraform1.11.0:       + timeout                    = 300
17:58:05.031 STDOUT terraform1.11.0:       + values                     = [
17:58:05.031 STDOUT terraform1.11.0:           + <<-EOT
17:58:05.031 STDOUT terraform1.11.0:                 "auth":
17:58:05.031 STDOUT terraform1.11.0:                   "existingSecret": "clickhouse-credentials"
17:58:05.031 STDOUT terraform1.11.0:                   "existingSecretPasswordKey": "password"
17:58:05.031 STDOUT terraform1.11.0:                 "image":
17:58:05.031 STDOUT terraform1.11.0:                   "pullPolicy": "IfNotPresent"
17:58
```
</details>